Repository: cpfed/diploma-cpfed-auth
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk

source: Пароли не совпадают
kk: Құпия сөздер бірдей емес

source: Код
kk: Жынысы

source: Электронная почта
kk: Электрондық пошта

source: Подтвердите пароль
kk: Құпия сөзді растаңыз

source: Хэндл может состоять только из латинских букв, цифр и _
kk: Хэндл тек латын әріптерінен, сандардан және _ тұру керек

source: ИИН может состоять только из 12 цифр
kk: ЖСН тек 12 саннан тұру керек

source: Хэндл
kk: Хэндл (никнейм)

source: Имя
kk: Есімі

source: Фамилия
kk: Тегі

source: Телефонный номер
kk: Телефон нөмірі

source: Пол
kk: Жынысы

source: ИИН
kk: ЖСН

source: Размер футболки
kk: Футболка өлшемі

source: Статус занятости
kk: Жұмыспен қамту мәртебесі

source: Место учебы или работы
kk: Оқу немесе жұмыс орны

source: Регион
kk: Аймағы

source: Гражданин РК?
kk: ҚР азаматы??

source: Аккаунт удален?
kk: Аккаунт жойылды ма?

source: Аккаунт активен?
kk: Аккаунт белсенді ме?

source: Пользователь
kk: Пайдаланушы

source: Пользователи
kk: Пайдаланушылар

source: Поле не может быть пустым
kk: Өріс бос болмауы керек

source: Ссылка использована?
kk: Сілтеме пайдаланылды ма?

source: Срок годности
kk: Жарамдылық мерзімі

source: Восстановление пароля
kk: Құпия сөзді қалпына келтіру

source: Пароль
kk: Құпиясөз

source: Хэндл уже занят
kk: Хэндл бос емес

source: Email уже занят
kk: Электрондық пошта бос емес

source: Активация аккаунта
kk: Аккаунтты белсендіру

source: Контест
kk: Сайыс

source: Использованный код
kk: Пайдаланылған код

source: Время использования
kk: Пайдалану уақыты

source: Указанный для восстановления пароля email не найден
kk: Құпиясөзді қалпына келтіру үшін көрсетілген электрондық пошта табылмады

source: Ссылка для восстановления пароля отправлена на почту.
kk: Құпиясөзді қалпына келтіру сілтемесі поштаға жіберіледі.

source: Ссылка уже использована.
kk: Сілтеме пайдаланылды.

source: Ссылка для восстановления пароля уже устарела. Попробуйте заново.
kk: Таңдалған қалпына келтіру сілтемесі ескірген. Қайтадан көріңіз.

source: Пароль успешно изменен!
kk: Құпиясөз сәтті өзгертілді!

source: Введите новый пароль
kk: Жаңа құпиясөзді енгізіңіз

source: На почту отправлено письмо для активации аккаунта
kk: Аккаунтты белсендіру үшін поштаға хат жіберілді

source: Зарегистрироваться
kk: Тіркелу

source: Ссылка уже использована
kk: Сілтеме пайдаланылды

source: Ссылка для активации аккаунта устарела
kk: Аккаунтты белсендіру сілтемесі ескірген

source: Некорректный хэндл/email или пароль
kk: Қате хэндл/электрондық пошта немесе құпиясөз

source: Войти в аккаунт
kk: Аккаунтқа кіру

source: Некорректный код
kk: Қате код

source: Войти в аккаунт по коду
kk: Тіркелгіге код бойынша кіріңіз

source: Название контеста
kk: Сайыстың аты

source: Описание контеста
kk: Сайыстың сипаттамасы

source: Дата контеста
kk: Сайыстың күні

source: Ссылка на контест
kk: Сайыстың сілтеме

source: Контесты
kk: Сайыстар

source: ID пользователя
kk: Пайдалануштың ID

source: ID контеста
kk: Сайыстың ID

source: Данные пользователей к контестам
kk: Сайыстарға арналған пайдаланушы деректері

source: Регистрация
kk: Тіркеу

source: Регистрация закрыта
kk: Тіркеу жабық

source: Вы уже зарегистрированы!
kk: Сіз қазірдің өзінде тіркелдіңіз!

source: Ссылка на API с результатами контеста
kk: Сайыстың сілтеме

source: Работаю в офисе
kk: Кеңседе жұмыс істеймін

source: Да
kk: Иә

source: Нет
kk: Жоқ

source: Дивизион 1 – ученики гимназий, лицеев, областных, частных и специализированных школ.
kk: 1-дивизион – гимназия, лицей, облыстық, жекеменшік және мамандандырылған мектеп оқушылары.

source: Дивизион 2 – ученики городских, районных и сельских общеобразовательных школ.
kk: 2-дивизион – қалалық, аудандық және ауылдық жалпы білім беретін мектеп оқушылары.

source: Район
kk: Ауданы

source: Класс обучения
kk: Оқу сыныбы

source: Язык обучения
kk: Оқу тілі

source: Формат работы
kk: Жұмыс форматы

source: Телефон одного из родителей
kk: Ата-аналардың бірінің телефоны

source: Дата рождения
kk: Туған жылы

source: Акмолинская область
kk: Ақмола облысы

source: Аккольский, Аршалынский, Астраханский, Атбасарский, Буландынский, Бурабайский, Егиндыкольский, Ерейментауский, Жаксынский, Жаркаинский, Зерендинский, Коргалжынский, Сандыктауский, Целиноградский, Шортандинский, Кокшетау, Степногорск
kk: Ақкөл, Аршалы, Астрахан, Атбасар, Бұланды, Бурабай, Егіндікөл, Ерейментау, Жақсы, Жарқайың, Зеренді, Қорғалжын, Сандықтау, Целиноград, Шортанды, Көкшетау, Степногорск

source: Актюбинская область
kk: Ақтөбе облысы

source: Алгинский, Байганинский, Каргалинский, Хромтауский, Мугалжарский, Шалкарский, Темирский, Ыргызский, Актобе, Алга, Кандыагаш, Эмба
kk: Алға, Байғанин, Қарғалы, Хромтау, Мұғалжар, Шалқар, Темір, Ырғыз, Ақтөбе, Алға, Қандыағаш, Ембі

source: Алматинская область
kk: Алматы облысы

source: Балхашский, Енбекшиказахский, Жамбылский, Илийский, Карасайский, Кербулакский, Коксуский, Панфиловский, Талгарский, Уйгурский, Талдыкорган, Капшагай, Текели, Райымбек
kk: Балқаш, Еңбекшіқазақ, Жамбыл, Іле, Қарасай, Кербұлақ, Көксу, Панфилов, Талғар, Ұйғыр, Талдықорған, Қапшағай, Текелі, Райымбек

source: Атырауская область
kk: Атырау облысы

source: Жылыойский, Индерский, Исатайский, Курмангазинский, Кызылкогинский, Макатский, Махамбетский, Атырау, Кульсары
kk: Жылыой, Индер, Исатай, Құрманғазы, Қызылқоға, Мақат, Махамбет, Атырау, Құлсары

source: Восточно-Казахстанская область
kk: Шығыс Қазақстан облысы

source: Абайский, Бескарагайский, Бородулихинский, Глубоковский, Жарминский, Катон-Карагайский, Кокпектинский, Курчумский, Шемонаихинский, Уланский, Урджарский, Усть-Каменогорск, Семей, Риддер, Курчатов
kk: Абай, Бесқарағай, Бородулиха, Глубокое, Жарма, Катонқарағай, Көкпекті, Күршім, Шемонаиха, Ұлан, Үржар, Өскемен, Семей, Риддер, Күрчатов

source: Жамбылская область
kk: Жамбыл облысы

source: Байзакский, Жамбылский, Жуалынский, Кордайский, Меркенский, Мойынкумский, Рыскуловский, Сарысуский, Таласский, Шуский, Тараз, Каратау, Шу
kk: Байзақ, Жамбыл, Жуалы, Қордай, Меркі, Мойынқұм, Рысқұлов, Сарысу, Талас, Шу, Тараз, Қаратау, Шу

source: Западно-Казахстанская область
kk: Батыс Қазақстан облысы

source: Акжаикский, Байтерекский, Бокейординский, Жанибекский, Казталовский, Каратобинский, Сырымский, Таскалинский, Чингирлауский, Уральск, Аксай
kk: Ақжайық, Бәйтерек, Бөкейорда, Жәнібек, Қазталов, Қаратөбе, Сырым, Тасқала, Шыңғырлау, Орал, Ақсай

source: Карагандинская область
kk: Қарағанды облысы

source: Абайский, Актогайский, Бухар-Жырауский, Жанааркинский, Каркаралинский, Нуринский, Осакаровский, Шетский, Улытауский, Караганда, Темиртау, Балхаш, Жезказган, Сарань, Шахтинск
kk: Абай, Ақтоғай, Бұқар жырау, Жаңаарқа, Қарқаралы, Нұра, Осакаров, Шет, Ұлытау, Қарағанды, Теміртау, Балқаш, Жезқазған, Саран, Шахтинск

source: Костанайская область
kk: Қостанай облысы

source: Алтынсаринский, Амангельдинский, Аулиекольский, Денисовский, Жангельдинский, Карабалыкский, Карасуский, Костанайский, Мендыкаринский, Наурзумский, Сарыкольский, Тарановский, Узункольский, Федоровский, 1 Костанай, Рудный, Лисаковск, Житикара
kk: Алтынсарин, Аманкелді, Әулиекөл, Денисов, Жангелді, Қарабалық, Қарасу, Қостанай, Меңдіқара, Науырзым, Сарыкөл, Таранов, Ұзынкөл, Федоров, Қостанай, Рудный, Лисаковск, Жітіқара

source: Кызылординская область
kk: Қызылорда облысы

source: Аральский, Жалагашский, Жанакорганский, Кармакшинский, Казалинский, Сырдарьинский, Шиелийский, Кызылорда, Байконыр, Аральск
kk: Арал, Жалағаш, Жаңақорған, Қармақшы, Қазалы, Сырдария, Шиелі, Қызылорда, Байқоңыр, Арал

source: Мангистауская область
kk: Маңғыстау облысы

source: Бейнеуский, Каракиянский, Мангистауский, Мунайлинский, Тупкараганский, Актау, Жанаозен
kk: Бейнеу, Қарақия, Маңғыстау, Мұнайлы, Түпқараған, Ақтау, Жаңаөзен

source: Павлодарская область
kk: Павлодар облысы

source: Аккулынский, Баянаульский, Железинский, Иртышский, Качирский, Майский, Павлодарский, Успенский, Щербактинский, Павлодар, Аксу, Экибастуз
kk: Аққулы, Баянауыл, Железинка, Ертіс, Қашыр, Май, Павлодар, Успен, Шарбақты, Павлодар, Ақсу, Екібастұз

source: Северо-Казахстанская область
kk: Солтүстік Қазақстан облысы

source: Айыртауский, Акжарский, Есильский, Жамбылский, Кызылжарский, Магжана Жумабаева, Мамлютский, Тайыншинский, Тимирязевский, Уалихановский, Шал акына, Петропавловск, Булаево, Сергеевка
kk: Айыртау, Ақжар, Есіл, Жамбыл, Қызылжар, Мағжан Жұмабаев, Мамлют, Тайынша, Тимирязев, Уәлиханов, Шал ақын, Петропавл, Булаев, Сергеев

source: Туркестанская область
kk: Түркістан облысы

source: Байдибекский, Жетысайский, Казыгуртский, Келесский, Мактааральский, Ордабасынский, Отырарский, Сайрамский, Сарыагашский, Толебийский, Тюлькубасский, Шардаринский, Туркестан, Кентау, Арыс, Шымкент, Сауран
kk: Байдібек, Жетісай, Қазығұрт, Келес, Мақтаарал, Ордабасы, Отырар, Сайрам, Сарыағаш, Төле би, Түлкібас, Шардара, Түркістан, Кентау, Арыс, Шымкент, Сауран

source: Астана
kk: Астана қаласы

source: Алматинский, Байконырский, Есильский, Сарыаркинский
kk: Алматы, Байқоңыр, Есіл, Сарыарқа

source: Алматы
kk: Алматы қаласы

source: Алмалинский, Ауэзовский, Бостандыкский, Жетысуский, Медеуский, Наурызбайский, Турксибский
kk: Алмалы, Әуезов, Бостандық, Жетісу, Медеу, Наурызбай, Түрксіб

source: Шымкент
kk: Шымкент қаласы

source: Абайский, Аль-Фарабийский, Енбекшинский, Каратауский
kk: Абай, Әл-Фараби, Еңбекші, Қаратау

source: Абайская область
kk: Абай облысы

source: Абайский, Бескарагайский, Бородулихинский, Жарминский, Кокпектинский, Уланский, Семей
kk: Абай, Бесқарағай, Бородулиха, Жарма, Көкпекті, Ұлан, Семей

source: Жетысуйская область
kk: Жетісу облысы

source: Аксуский, Алакольский, Ескельдинский, Каратальский, Кербулакский, Коксуский, Панфиловский, Сарканский, Талдыкорган, Текели
kk: Ақсу, Алакөл, Ескелді, Қаратал, Кербұлақ, Көксу, Панфилов, Сарқан, Талдықорған, Текелі

source: Улытауская область
kk: Ұлытау облысы

source: Жанааркинский, Улытауский, Жезказган
kk: Жаңаарқа, Ұлытау, Жезқазған

source: Название региона
kk: Аймақ атауы

source: Регионы
kk: Аймақтар

source: Время создания
kk: Құру уақыты

source: Время последнего изменения
kk: Соңғы өзгеріс уақыты

source: Главная
kk: Негізгі бет

source: Соревнования
kk: Сайыстар

source: О ЧРК
kk: ҚРЧ туралы

source: О нас
kk: Біз туралы

source: Контакты
kk: Контактілер

source: Привет
kk: Сәлем

source: Выйти
kk: Шығу

source: Войти
kk: Кіру

source: Помощь
kk: Көмек

source: Все права защищены.
kk: Барлық құқықтар қорғалған.

source: Отправить
kk: Жіберу

source: Как зарегистрироваться на контест?
kk: Контестке қалай тіркелуге болады?

source: Следуйте простым шагам, чтобы принять участие в соревнованиях:
kk: Қатысу үшін келесі қарапайым қадамдарды орындаңыз:

source: 1️⃣ Нажмите кнопку ниже «Зарегистрироваться на контест»
kk: 1️⃣ «Контестке тіркелу» батырмасын басыңыз

source: Вы будете перенаправлены на страницу регистрации на платформе.
kk: Сіз платформадағы тіркеу бетіне өтесіз.

source: Заполните форму регистрации и подтвердите свою почту – на email придёт письмо с ссылкой для активации.
kk: Тіркеу формасын толтырыңыз және поштаңызды растаңыз – email-ге сілтеме бар хат келеді.

source: 3️⃣ Вернитесь на страницу контеста и зарегистрируйтесь
kk: 3️⃣ Контест бетіне қайта оралып, тіркеліңіз

source: После подтверждения почты снова зайдите на страницу регистрации контеста и завершите процесс.
kk: Поштаңызды растағаннан кейін контест тіркеу бетіне қайта кіріп, тіркеуді аяқтаңыз.

source: Поздравляем! Вы успешно зарегистрированы!
kk: Құттықтаймыз! Сіз сәтті тіркелдіңіз!

source: Ожидайте уведомления с подробностями и готовьтесь к соревнованию!
kk: Толық ақпаратты күтіңіз және жарысқа дайындалыңыз!

source: Зарегистрироваться на контест
kk: Сайысқа қатысу

source: Вы успешно зарегистрированы!
kk: Сіз сәтті тіркелдіңіз!

source: Вся подробная информация будет выходить в наших социальных сетях, а также в виде смс и звонков. Просим следить за звонками с незнакомых номеров.
kk: Барлық маңызды ақпарат біздің әлеуметтік желілерімізде, сондай-ақ SMS хабарламалар мен қоңыраулар арқылы жіберіледі. Сондықтан бейтаныс нөмірлерден келетін қоңырауларға назар аударуды сұраймыз.

source: Подпишитесь на нас в социальных сетях:
kk: Біздің парақшаларымызға жазылыңыз

source: Согласен с политикой <a href="https://drive.google.com/file/d/1ReERKx_HgGimV-pp5n_DEMfB6-axesku/view" class="text-blue-600">конфиденциальности</a>
kk: <a href="https://drive.google.com/file/d/1ReERKx_HgGimV-pp5n_DEMfB6-axesku/view" class="text-blue-600">Құпиялылық саясатымен</a> келісемін

source: Здравствуйте
kk: Сәлеметсізбе

source: Недавно вы запросили сброс пароля для вашей учетной записи Cpfed. Нажмите на кнопку ниже, чтобы продолжить.
kk: Жақында сіз Cpfed есептік жазбаңыздың құпия сөзін қалпына келтіруді сұрадыңыз. Жалғастыру үшін төмендегі түймені басыңыз.

source: Сбросить мой пароль
kk: Менің құпия сөзімді қалпына келтіру

source: Если вы не запрашивали сброс, пожалуйста, проигнорируйте это письмо. Ссылка действительна только в течение следующих 30 минут.
kk: Егер сіз қалпына келтіруді сұрамаған болсаңыз, бұл электрондық поштаны елемеңіз. Сілтеме келесі 30 минут ішінде ғана жарамды.

source: Спасибо
kk: Рақмет

source: команда Cpfed.
kk: Cpfed командасы.

source: Для подтверждения электронной почты и завершения процесса регистрации, нажмите на кнопку ниже.
kk: Электрондық поштаны растау және тіркеу процесін аяқтау үшін төмендегі түймені басыңыз.

source: Активировать аккаунт
kk: Есептік жазбаны іске қосыңыз

source: Если вы получили это письмо по ошибке, просто игнорируйте его. Ссылка действительна только в течение следующих 30 минут.
kk: Егер сіз бұл электрондық поштаны қате алсаңыз, оны елемеңіз. Сілтеме келесі 30 минут ішінде ғана жарамды.

source: Забыли пароль?
kk: Құпия сөзіңізді ұмыттыңыз ба?

source: Чемпионаты и турниры — время побеждать!
kk: Чемпионаттар мен турнирлер — жеңіске жететін уақыт!

source: Тебя ждут захватывающие турниры, где ты можешь проявить свои навыки в программировании. Прими участие в чемпионатах, узнай расписание и зарегистрируйся, чтобы не упустить шанс стать лучшим!
kk: Сізді қызықты турнирлер күтеді, онда сіз бағдарламалау дағдыларын көрсете аласыз. Чемпионаттарға қатысыңыз, кестені біліңіз және ең жақсы болу мүмкіндігін жіберіп алмау үшін тіркеліңіз!

source: Узнать больше
kk: Көбірек біліңіз

source: Федерация спортивного программирования Казахстана CPFED
kk: Қазақстанның спорттық бағдарламалау федерациясы CPFED

source: Наша основная цель - развивать человеческий потенциал нашей страны и всего мира через спортивное программирование. На данном сайте вы можете зарегистрироваться на все наши соревнования и стать частью сообщества спортивного программирования в Казахстане.
kk: Біздің басты мақсатымыз - спорттық бағдарламалау арқылы еліміздің және бүкіл әлемнің адами әлеуетін дамыту. Осы сайтта сіз біздің барлық жарыстарымызға тіркеліп, Қазақстандағы спорттық бағдарламалау қоғамдастығының бір бөлігі бола аласыз.

source: Чемпионаты и конкурсы
kk: Чемпионаттар мен сайыстар

source: Дата
kk: Күні

source: Время
kk: Уақыт

source: Вы уже зарегистрированы
kk: Сіз қазірдің өзінде тіркелдіңіз!

source: Войти на контест
kk: Сайыстың күні

source: Войти на пробный тур
kk: Танысу кезеңде кіру

source: Остался %(days)s день
kk: %(days)s күн қалды

source: Мужской
kk: Еркек

source: Женский
kk: Әйел

source: Небинарный
kk: Небинарлық

source: Работаю
kk: Жұмыс істеймін

source: Учусь
kk: Оқимын

source: Не учусь и не работаю
kk: Оқымаймын және жұмыс істемеймін

source: Введённый пароль слишком короткий. Он должен содержать как минимум 8 символов.
kk: Енгізілген құпия сөз тым қысқа. Ол кем дегенде 8 таңбадан тұруы керек.

source: Введённый пароль слишком широко распространён.
kk: Енгізілген құпия сөз тым кең таралған.

source: Введённый пароль состоит только из цифр.
kk: Енгізілген пароль тек сандардан тұрады.

source: Введите корректный номер телефона (например, 8 (71234) 5 67 89) или номер с префиксом международной связи.
kk: Дұрыс телефон нөмірін (мысалы, 8 (712) 345 67 89) немесе халықаралық байланыс префиксі бар нөмірді енгізіңіз.

source: Пользователь с таким Телефонный номер уже существует.
kk: Бұндай телефон нөмірі бар пайдаланушы бар.
