LANG_DICT = {
    0: {
        "CONTESTS": "💻 Келесі сайыстар",
        "COMMUNITY": "👥 Қауымдастыққа қосылыңыз",
        "COMMUNITY_CHATS": "Қауымдастықтың сілтемесі",
        "CHOOSE_ACTION": "Әрекет таңдаңыз",
        "HELLO": "Сәлеметсізбе",
        "TELEGRAM_INTEGRATION_SUCCESS": "Telegram интеграциясы сәтті өтті.",
        "CONTESTS_LIST": "Сайыстар тізімі",
        "LINK": "сілтеме",
        "TIME": "Өткізу уақыты"
    },
    1: {
        "CONTESTS": "💻 Предстоящие контесты",
        "COMMUNITY": "👥 Присоединяйтесь к сообществу",
        "COMMUNITY_CHATS": "Ссылка на сообщество",
        "CHOOSE_ACTION": "Выберите действие",
        "HELLO": "Здравствуйте",
        "TELEGRAM_INTEGRATION_SUCCESS": "Интеграция Telegram прошла успешно.",
        "CONTESTS_LIST": "Список соревнований",
        "LINK": "Ссылка",
        "TIME": "Время проведения"
    }
}